Repository: aleksandar-stefanovic/urmsimulator
Catalog: po/extra/*.po
Languages: fr

source: URM Simulator
fr: Simulateur URM

source: A simple URM Simulator.
fr: Un simple simulateur URM

source: URM;Simulator;
fr: URM;Simulateur;

source: Simple URM simulations
fr: Simples simulations URM

source: URM (Unlimited Register Machine) is a theoretical machine which has unlimited memory. It is used to describe that anything that can be programmed with four basic instructions can also be programmed with any other programming language.
fr: URM (Unlimited Register Machine) est une machine théorique a mémoire illimitée. On l'utilise pour décrire que tout ce qui peut être programmé avec quatre instructions simples peut aussi être programmé avec n'importe quel langage de programmation.

source: Use four basic instructions (Zero, Successor, Transfer, Jump) to program any other operator or function, since things like subtraction are not included!
fr: Utilisez quatre instructions basiques (Zero, Successor, Transfer, Jump) pour programmer n'importe quel autre opérateur ou fonction, comme la soustraction qui n'est pas incluse !

source: Features:
fr: Fonctionalités :

source: Executes URM code correctly
fr: Exécutez du code URM correctement

source: Ability to load a file
fr: Possibilité de charger un fichier

source: Ability to manually set initial values
fr: Possibilité de définir manuellement les valeurs initiales

source: When in debug mode, shows the result after each instruction
fr: En mode débogage, le résultat est affiché après chaque instruction

source: Upon finishing, shows the state of all the used registers
fr: Une fois terminé, l'état de tous les registres utilisé est affiché

source: Has sythax highlighting
fr: Coloration syntaxique

source: First Juno Release
fr: Première version pour Juno

source: Fixed issues with the project, which made it possible to publish to AppCenter again. Big thanks to Ryo Nakano!
fr: Correction de problèmes avec le projet, ce qui a permis de le publier à nouveau dans le Centre d'Applications. Merci beaucoup à Ryo Nakano !

source: Packaging hotfix
fr: Correction critique de paquet

source: Fixed issues with Debian packaging.
fr: Correction de problèmes avec les paquets Debian.

source: Scrollable Views
fr: Vues défilables

source: Views are now scrollable.
fr: Les vues sont désormais défilables.

source: Basic input checking has been added.
fr: Un version basique de vérification de saisie a été ajoutée.

source: No More Freezes
fr: Plus de plantages

source: Text files can now be opened.
fr: Les fichiers Texte peuvent désormais être ouverts.

source: Execution cap is added, to avoid freezing.
fr: Un capuchon d'exécution a été ajouté, pour éviter les plantages.

source: Instructions are now one-based numbered.
fr: Les instructions sont désormais numérotées en base un.
